{
    "format": "graph-model",
    "generatedBy": "2.17.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "signature": {
        "outputs": {
            "Identity:0": {
                "name": "Identity:0"
            }
        }
    },
    "modelTopology": {
        "node": [{
            "name": "ConstantFolding/model_59/tf.math.divide_2/truediv_recip",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {}
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_59/ones_like/tensor",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT64"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_59/StridedSlice/end",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT64"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_59/ones_like",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_INT64"
                }
            }
        }, {
            "name": "model_59/tf.math.add_241/Add/y",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "1"
                            }, {
                                "size": "2"
                            }, {
                                "size": "8400"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/48956",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "1"
                            }, {
                                "size": "2"
                            }, {
                                "size": "8400"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_56/StridedSlice/begin",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_INT64"
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_56/StridedSlice/end",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT64"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_56/StridedSlice/strides",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT64"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.reshape_41/Reshape/shape",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_INT32",
                        "tensorShape": {
                            "dim": [{
                                "size": "4"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_INT32"
                }
            }
        }, {
            "name": "model_59/tf.compat.v1.transpose_282/transpose/perm",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_INT32",
                        "tensorShape": {
                            "dim": [{
                                "size": "4"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_INT32"
                }
            }
        }, {
            "name": "model_59/tf.compat.v1.transpose_283/transpose/perm",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT32"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT32",
                        "tensorShape": {
                            "dim": [{
                                "size": "4"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_203/convolution/filter",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "1"
                            }, {
                                "size": "1"
                            }, {
                                "size": "16"
                            }, {
                                "size": "1"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.compat.v1.transpose_288/transpose/perm",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_INT32",
                        "tensorShape": {
                            "dim": [{
                                "size": "4"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_INT32"
                }
            }
        }, {
            "name": "model_59/tf.reshape_44/Reshape/shape",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT32"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT32",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_58/ones_like/tensor",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT64"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_58/StridedSlice/end",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT64"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_58/ones_like",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT64"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.concat_62/concat/axis",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_INT32",
                        "tensorShape": {}
                    }
                },
                "dtype": {
                    "type": "DT_INT32"
                }
            }
        }, {
            "name": "model_59/tf.math.multiply_760/Mul/y",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "1"
                            }, {
                                "size": "1"
                            }, {
                                "size": "8400"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_172/convolution/filter",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }, {
                                "size": "3"
                            }, {
                                "size": "64"
                            }, {
                                "size": "64"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.math.add_210/Add/y",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "64"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_174/convolution/filter",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }, {
                                "size": "3"
                            }, {
                                "size": "64"
                            }, {
                                "size": "64"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.math.add_212/Add/y",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "64"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_179/convolution/filter",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "1"
                            }, {
                                "size": "1"
                            }, {
                                "size": "64"
                            }, {
                                "size": "64"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.math.add_217/Add/y",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "64"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_173/convolution/filter",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }, {
                                "size": "3"
                            }, {
                                "size": "64"
                            }, {
                                "size": "80"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.math.add_211/Add/y",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "80"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_177/convolution/filter",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }, {
                                "size": "3"
                            }, {
                                "size": "80"
                            }, {
                                "size": "80"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.math.add_215/Add/y",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "80"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_182/convolution/filter",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "1"
                            }, {
                                "size": "1"
                            }, {
                                "size": "80"
                            }, {
                                "size": "80"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.math.add_220/Add/y",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "80"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.concat_52/concat/axis",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_INT32",
                        "tensorShape": {}
                    }
                },
                "dtype": {
                    "type": "DT_INT32"
                }
            }
        }, {
            "name": "model_59/tf.compat.v1.transpose_249/transpose/perm",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_INT32",
                        "tensorShape": {
                            "dim": [{
                                "size": "4"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_INT32"
                }
            }
        }, {
            "name": "model_59/tf.reshape_32/Reshape/shape",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT32"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT32",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_187/convolution/filter",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }, {
                                "size": "3"
                            }, {
                                "size": "128"
                            }, {
                                "size": "64"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.math.add_225/Add/y",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "64"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_189/convolution/filter",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }, {
                                "size": "3"
                            }, {
                                "size": "64"
                            }, {
                                "size": "64"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.math.add_227/Add/y",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "64"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_192/convolution/filter",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "1"
                            }, {
                                "size": "1"
                            }, {
                                "size": "64"
                            }, {
                                "size": "64"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.math.add_230/Add/y",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "64"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_188/convolution/filter",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }, {
                                "size": "3"
                            }, {
                                "size": "128"
                            }, {
                                "size": "80"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.math.add_226/Add/y",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "80"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_190/convolution/filter",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }, {
                                "size": "3"
                            }, {
                                "size": "80"
                            }, {
                                "size": "80"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.math.add_228/Add/y",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "80"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_193/convolution/filter",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "1"
                            }, {
                                "size": "1"
                            }, {
                                "size": "80"
                            }, {
                                "size": "80"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.math.add_231/Add/y",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "80"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.concat_55/concat/axis",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT32"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT32",
                        "tensorShape": {}
                    }
                }
            }
        }, {
            "name": "model_59/tf.compat.v1.transpose_263/transpose/perm",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT32"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT32",
                        "tensorShape": {
                            "dim": [{
                                "size": "4"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.reshape_35/Reshape/shape",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT32"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT32",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_197/convolution/filter",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }, {
                                "size": "3"
                            }, {
                                "size": "256"
                            }, {
                                "size": "64"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.math.add_235/Add/y",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "64"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_199/convolution/filter",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }, {
                                "size": "3"
                            }, {
                                "size": "64"
                            }, {
                                "size": "64"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.math.add_237/Add/y",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "64"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_201/convolution/filter",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "1"
                            }, {
                                "size": "1"
                            }, {
                                "size": "64"
                            }, {
                                "size": "64"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.math.add_239/Add/y",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "64"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_54/ones_like/tensor",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT64"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "4"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_54/StridedSlice/end",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "4"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_INT64"
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_54/ones_like",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT64"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "4"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_52/ones_like/tensor",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT64"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "4"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_52/StridedSlice/end",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT64"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "4"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_52/ones_like",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "4"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_INT64"
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_50/ones_like/tensor",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "4"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_INT64"
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_50/StridedSlice/end",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT64"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "4"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_50/ones_like",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "4"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_INT64"
                }
            }
        }, {
            "name": "model_59/tf.image.resize_5/resize/size",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_INT32",
                        "tensorShape": {
                            "dim": [{
                                "size": "2"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_INT32"
                }
            }
        }, {
            "name": "model_59/tf.concat_47/concat/axis",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_INT32",
                        "tensorShape": {}
                    }
                },
                "dtype": {
                    "type": "DT_INT32"
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_167/convolution/filter",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "1"
                            }, {
                                "size": "1"
                            }, {
                                "size": "192"
                            }, {
                                "size": "64"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.math.add_205/Add/y",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "64"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_51/ones_like/tensor",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT64"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "4"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_51/StridedSlice/end",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "4"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_INT64"
                }
            }
        }, {
            "name": "model_59/tf.strided_slice_51/ones_like",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_INT64",
                        "tensorShape": {
                            "dim": [{
                                "size": "4"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_INT64"
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_168/convolution/filter",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }, {
                                "size": "3"
                            }, {
                                "size": "32"
                            }, {
                                "size": "32"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.math.add_206/Add/y",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "32"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_169/convolution/filter",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }, {
                                "size": "3"
                            }, {
                                "size": "32"
                            }, {
                                "size": "32"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.math.add_207/Add/y",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "32"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.concat_48/concat/axis",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_INT32"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_INT32",
                        "tensorShape": {}
                    }
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_170/convolution/filter",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "1"
                            }, {
                                "size": "1"
                            }, {
                                "size": "96"
                            }, {
                                "size": "64"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
            "name": "model_59/tf.math.add_208/Add/y",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "64"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.compat.v1.pad_19/Pad/paddings",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_INT32",
                        "tensorShape": {
                            "dim": [{
                                "size": "4"
                            }, {
                                "size": "2"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_INT32"
                }
            }
        }, {
            "name": "model_59/tf.nn.convolution_171/convolution/filter",
            "op": "Const",
            "attr": {
                "dtype": {
                    "type": "DT_FLOAT"
                },
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "3"
                            }, {
                                "size": "3"
                            }, {
                                "size": "64"
                            }, {
                                "size": "64"
                            }]
                        }
                    }
                }
            }
        }, {
            "name": "model_59/tf.math.add_209/Add/y",
            "op": "Const",
            "attr": {
                "value": {
                    "tensor": {
                        "dtype": "DT_FLOAT",
                        "tensorShape": {
                            "dim": [{
                                "size": "64"
                            }]
                        }
                    }
                },
                "dtype": {
                    "type": "DT_FLOAT"
                }
            }
        }, {
